In [1]:
import pandas as pd
import numpy as np

In [38]:
person = {
     'first' : ['Jahid','Mahadi','Marina','Ayat', np.nan, None, 'NA'],
     'last' : ['hasan','hasan','akter','hasan', np.nan, np.nan, 'Missing'],
     'email' : ['jahid@hasan.com','mahadi@hasan.com','marina@akter.com',np.nan, None, 'ananomus@email.com','Missing'],
     'age': ['22','44','60','55', None, None,'Missing']
}

In [39]:
df = pd.DataFrame(person)


df.replace(['NA','Missing'], np.nan, inplace=True)

In [40]:
df

    first   last               email   age
0   Jahid  hasan     jahid@hasan.com    22
1  Mahadi  hasan    mahadi@hasan.com    44
2  Marina  akter    marina@akter.com    60
3    Ayat  hasan                 NaN    55
4     NaN    NaN                None  None
5    None    NaN  ananomus@email.com  None
6     NaN    NaN                 NaN   NaN

In [41]:
df.dropna()

    first   last             email age
0   Jahid  hasan   jahid@hasan.com  22
1  Mahadi  hasan  mahadi@hasan.com  44
2  Marina  akter  marina@akter.com  60

In [42]:
df.dropna(axis="index", how='all')

    first   last               email   age
0   Jahid  hasan     jahid@hasan.com    22
1  Mahadi  hasan    mahadi@hasan.com    44
2  Marina  akter    marina@akter.com    60
3    Ayat  hasan                 NaN    55
5    None    NaN  ananomus@email.com  None

In [43]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

    first   last               email   age
0   Jahid  hasan     jahid@hasan.com    22
1  Mahadi  hasan    mahadi@hasan.com    44
2  Marina  akter    marina@akter.com    60
3    Ayat  hasan                 NaN    55
5    None    NaN  ananomus@email.com  None

In [44]:
df.fillna('MISSING')

     first     last               email      age
0    Jahid    hasan     jahid@hasan.com       22
1   Mahadi    hasan    mahadi@hasan.com       44
2   Marina    akter    marina@akter.com       60
3     Ayat    hasan             MISSING       55
4  MISSING  MISSING             MISSING  MISSING
5  MISSING  MISSING  ananomus@email.com  MISSING
6  MISSING  MISSING             MISSING  MISSING

In [45]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [48]:
df['age'] = df['age'].astype(float)

In [49]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [50]:
df['age'].median()

49.5

In [51]:
df['age'].mean()

45.25